In [1]:
import pandas as pd

In [2]:
filmes = pd.read_csv("filmesMovieLens.csv") # filmes é um DataFrame
filmes.columns = ["filmeId", "titulo", "generos"] # renomear colunas
filmes.head() # mostrar as 5 primeiras linhas

,filmeId,titulo,generos
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [7]:
# lendo a documentação de um método/atributo
filmes.head?

In [8]:
# lendo a documentação do tipo (docstring)
filmes?

In [9]:
avaliacoes = pd.read_csv("notasMovieLens.csv")
avaliacoes.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [10]:
avaliacoes.shape # mostra o numero de linhas e colunas

(100836, 4)

In [12]:
avaliacoes.columns = ["usuarioId", "filmeId", "nota", "momento"]
avaliacoes.head()

   usuarioId  filmeId  nota    momento
0          1        1   4.0  964982703
1          1        3   4.0  964981247
2          1        6   4.0  964982224
3          1       47   5.0  964983815
4          1       50   5.0  964982931

In [ ]:
avaliacoes_do_filme_1 = avaliacoes.query("filmeId==1") # mostra apenas as avaliacoes do filme com id 1
avaliacoes_do_filme_1.head()